// import React from 'react';

// export default function Mcq() {
//     let questions = [
       
//               {
//                 'id':"1",
//                 "question": "तलका मध्ये कुन legume फसल हो?",
//                 "options": [
//                   "गहुँ",
//                   "सोयाबीन",
//                   "चामल",
//                   "मकै"
//                 ],
//                 "answer": "सोयाबीन"
//               },
//               {
//                 'id':"2",
//                 "question": "फसलको घुम्ती खेतीको मुख्य उद्देश्य के हो?",
//                 "options": [
//                   "माटोको उर्वरता बढाउनु",
//                   "कीट र रोगलाई घटाउनु",
//                   "फसलको उत्पादन वृद्धि गर्नु",
//                   "यी सबै"
//                 ],
//                 "answer": "यी सबै"
//               },
//               {
//                 'id':"3",
//                 "question": "कुन जीवजन्तु मुख्य रूपमा दूधको लागि पालेको हुन्छ?",
//                 "options": [
//                   "भेडा",
//                   "बकरी",
//                   "गाई",
//                   "बाँदर"
//                 ],
//                 "answer": "गाई"
//               },
//               {
//                 'id':"4",
//                 "question": "मकैको लागि आदर्श तापमान रेंज के हो?",
//                 "options": [
//                   "१०-१५°C",
//                   "२०-३०°C",
//                   "३०-४०°C",
//                   "१५-२५°C"
//                 ],
//                 "answer": "२०-३०°C"
//               },
//               {
//                 'id':"5",
//                 "question": "तलका मध्ये कुन कुखुराको प्रकार होइन?",
//                 "options": [
//                   "कुखुरा",
//                   "हंस",
//                   "बत्तख",
//                   "मेढा"
//                 ],
//                 "answer": "मेढा"
//               },
//               {
//                 'id':"6",
//                 "question": "पौधाको विकासका लागि सबैभन्दा आवश्यक पोषक तत्व कुन हो?",
//                 "options": [
//                   "नाइट्रोजन",
//                   "फस्फोरस",
//                   "पोटासियम",
//                   "क्याल्सियम"
//                 ],
//                 "answer": "नाइट्रोजन"
//               },
//               {
//                 'id':"7",
//                 "question": "फसल र पशुपालन दुवै खेती गर्ने प्रविधीलाई के भनिन्छ?",
//                 "options": [
//                   "मिश्रित खेती",
//                   "तीव्र खेती",
//                   "व्यापक खेती",
//                   "जैविक खेती"
//                 ],
//                 "answer": "मिश्रित खेती"
//               },
//               {
//                 'id':"8",
//                 "question": "कुन फसललाई 'गहुँको राजा' भनेर चिनिन्छ?",
//                 "options": [
//                   "चामल",
//                   "गहुँ",
//                   "बार्ली",
//                   "मकै"
//                 ],
//                 "answer": "गहुँ"
//               },
//               {
//                 'id':"9",
//                 "question": "सिलेजको मुख्य उपयोग के हो?",
//                 "options": [
//                   "इन्धन",
//                   "पशुपालनको चारा",
//                   "उर्वरक",
//                   "सिंचाइ"
//                 ],
//                 "answer": "पशुपालनको चारा"
//               }
          
//     ];

//     return (
//         <div className='m-5 p-5'>
//             {questions.map((data, index) => {
//                 let { id,question, options,answer } = data;
//                 return (
//                     <div key={index} className='flex flex-col'>
//                         <h4>{id}. {question}</h4>
//                         <div className='grid grid-cols-4 p-2  m-2 gap-2'>
//                         {options.map((option, optionIndex) => (
//                             <>
//                             <div key={optionIndex} >
//                                 <div className='gap-5 flex'>
//                                 <input type="radio" id={`question-${index}-option-${optionIndex}`} name={`question-${index}`} value={option} />
//                                 <label htmlFor={`question-${index}-option-${optionIndex}`}  >{option}</label>
//                                 </div>
//                             </div>
//                             </>
//                             ))}
//                             </div>
//                     </div>
//                 );
//             })}
//             <p>उत्तर: सोयाबीन, यी सबै , गाई,२०-३०°C, मेढा,नाइट्रोजन, मिश्रित खेती, गहुँ, पशुपालनको चारा</p>
//         </div>
//     );
// }
